workshop3/OpenFOAM/cavity/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/
#include "${FOAM_CASE}/constant/parameters"

type            sets;
libs            ("libsampling.so");

writeControl    writeTime;

interpolationScheme cellPoint;

setFormat   raw;

fields  (U);

setConfig
{
    type    uniform; // midPoint, midPointAndFace (lineUniform in of6)
    axis    distance;  // x, y, z, xyz
    nPoints $size;
}

sets
(
    vertical
    {
        $setConfig;
        start ($mid 0   0);
        end   ($mid $dim 0);
    }
    
    horizontal
    {
        $setConfig;
        start (0   $mid 0);
        end   ($dim $mid 0);
    }
);


// ************************************************************************* //
